#include <stdio.h>

int main()
{
    int a=7;                //有符号数在计算机内部以补码表示 正数补码与原码相同 7=>0000 0111
    int b=-7;               //负数补码通过反码计算 -7 =>1111 1001
    unsigned int c=7;       //无符号数在计算机内部以原码表示   7=>0000 0111

    //无符号数无符号位 默认为正数 表示范围0~4294967295
    //有符号int 32位 首位符号位 表示范围-2147483648 ~ 2147483647


    int* p= &a;
    printf("a在内存中的16进制0x%08X\n",*p);

    p= &b;
    printf("b在内存中的16进制0x%08X\n",*p);

    p= &c;
    printf("c在内存中的16进制0x%08X\n",*p);

    return 0;
}
